---
kind: type
id: T:Autodesk.Revit.DB.VertexPair
source: html/3f0456e9-59a6-2c68-0f0c-d2355edb9693.htm
---
# Autodesk.Revit.DB.VertexPair

Indices of a pair of vertices in two CurveLoops(one vertex in each loop).

## Syntax (C#)
```csharp
public class VertexPair : IDisposable
```

## Remarks
A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.